#LEC00:このセクションの全体像====================#
#スライド1

#LEC01:Rmdファイルの作成=========================
#
#まずは、
#　File -> New File -> Rmarkdown
#　とクリックして新しいファイルを開きましょう
#　
#　そのさい、Presentation -> PowerPoint
#　とすることで、パワーポイントて力が設定された
#　Rmdファイルが生成されます
#　
#　(とは言ってもYAMLのoutput: powerpoint_presentation
#　という設定が追記されるだけなので、こちらの1行を何も考えずに作成して追記するだけでもまったく問題ありません）
#　YAMLって何！？という方は医師が教えるR言語でのデータ分析入門のRマークダウンのセクションで解説しておりますので、申し訳ありませんがそちらで確認していただけますと幸いです）
#　
#　この、作成されたRmdファイル、Knitをクリックしてパワーポイントファイルが出力されるかを確認してみてください。
#　出力されましたか？　
#　
#　それでは、次にパワーポイントファイルで表現できることについての解説を行っていきます。
#　
#LEC02:パワーポイント上の表現:導入=========================
#
#ここからの動画は、ppexp01.Rmd～を一つずつ解説していきます

#LEC03:パワーポイント上の表現:ppexp01 スライドの区切り===============
#LEC04:パワーポイント上の表現:ppexp02 改行===============
#LEC05:パワーポイント上の表現:ppexp03 箇条書き===============
#LEC06:パワーポイント上の表現:ppexp04 文章の修飾===============
#LEC07:パワーポイント上の表現:ppexp05 表===============
#LEC08:パワーポイント上の表現:ppexp06 図===============
#LEC09:パワーポイント上の表現:ppexp06-2 ノート===============
#LEC10:パワーポイント上の表現:ppexp07 Rチャンク===============
#LEC11:パワーポイント上の表現:final_report_raw=====
#LEC12:スライドをループ生成:Loop1===============
#LEC13:スライドをループ生成:Loop2===============
#LEC14:スライドをループ生成:Loop3===============
#LEC15:スライドをループ生成:Loop4===============
#LEC16:スライドをループ生成:Loop5===============
#LEC17:スライドをループ生成:Loop6===============
#LEC18:スライドを子チャンクから生成:全体像=======
#スライド１４-１６
#LEC19:スライドを子チャンクから生成:parent1==========
#LEC20:スライドを子チャンクから生成:parent2==========
#LEC21:スライドを子チャンクから生成:parent3==========
#LEC22:スライドを子チャンクから生成:parent4==========
#LEC23:スライドを子チャンクから生成:parent5==========
#LEC24:スライドを子チャンクから生成:parent6==========
#LEC25:実践的にループ生成してみよう！final_report_loop==========